### Dataset Link : https://www.kaggle.com/datasets/gustavomodelli/forest-fires-in-brazil

In [2]:
import pandas as pd 
import numpy as np

In [19]:
df = pd.read_csv('amazon.csv',encoding='iso-8859-1',parse_dates=['date'])

### 1. Display Top 5 Rows of The Dataset

In [20]:
df.head()

   year state    month  number       date
0  1998  Acre  Janeiro     0.0 1998-01-01
1  1999  Acre  Janeiro     0.0 1999-01-01
2  2000  Acre  Janeiro     0.0 2000-01-01
3  2001  Acre  Janeiro     0.0 2001-01-01
4  2002  Acre  Janeiro     0.0 2002-01-01

### 2. Check Last 5 Rows

In [21]:
df.tail()

      year      state     month  number       date
6449  2012  Tocantins  Dezembro   128.0 2012-01-01
6450  2013  Tocantins  Dezembro    85.0 2013-01-01
6451  2014  Tocantins  Dezembro   223.0 2014-01-01
6452  2015  Tocantins  Dezembro   373.0 2015-01-01
6453  2016  Tocantins  Dezembro   119.0 2016-01-01

### 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [22]:
df.shape

(6454, 5)

### 4. Getting Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6454 non-null   float64
 4   date    6454 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 252.2+ KB

### 5. Check For Duplicate Data and Drop Them

In [24]:
df.duplicated().sum()

32

In [25]:
df.drop_duplicates(inplace=True)

In [26]:
df.duplicated().sum()

0

### 6. Check Null Values In The Dataset

In [27]:
df.isnull().sum()

year      0
state     0
month     0
number    0
date      0
dtype: int64

### 7. Get Overall Statistics About The Dataframe

In [28]:
df.describe()

              year       number
count  6422.000000  6422.000000
mean   2007.490969   108.815178
std       5.731806   191.142482
min    1998.000000     0.000000
25%    2003.000000     3.000000
50%    2007.000000    24.497000
75%    2012.000000   114.000000
max    2017.000000   998.000000

### 8. Rename Month Names To English

In [29]:
df.columns

Index(['year', 'state', 'month', 'number', 'date'], dtype='object')

In [31]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

In [33]:
df['month_English']=df['month'].map({
    
    'Janeiro':'January',
    'Fevereiro':'Febuary',
    'Março':'March',
    'Abril':'April',
    'Maio':'May',
    'Junho':'June',
    'Julho':'July',
    'Agosto':'August',
    'Setembro':'September',
    'Outubro':'October',
    'Novembro':'November',
    'Dezembro':'December'
})

### 9. Total Number of Fires Registered

In [37]:
df.shape

(6422, 6)

### 10. In Which Month Maximum Number of Forest Fires Were Reported?

In [41]:
df.nlargest(1,['number'])['month_English']

888    September
Name: month_English, dtype: object

### 11. In Which Year Maximum Number of Forest Fires Was Reported?

In [43]:
df.nlargest(1,['number'])['year']

888    2008
Name: year, dtype: int64

### 12. In Which State Maximum Number of Forest Fires Was Reported?

In [44]:
df.columns

Index(['year', 'state', 'month', 'number', 'date', 'month_English'], dtype='object')

In [45]:
df.nlargest(1,['number'])['state']

888    Amazonas
Name: state, dtype: object

### 13. Find Total Number of Fires Were Reported In Amazonas

In [49]:
df.groupby('state')['number'].sum().loc['Amazonas']

30650.129

### 14. Display Number of Fires Were Reported In Amazonas (Year-Wise)

In [51]:
df.groupby(['state','year'])['number'].sum().loc['Amazonas']

year
1998     946.000
1999    1061.000
2000     853.000
2001    1297.000
2002    2852.000
2003    1524.268
2004    2298.207
2005    1657.128
2006     997.640
2007     589.601
2008    2717.000
2009    1320.601
2010    2324.508
2011    1652.538
2012    1110.641
2013     905.217
2014    2385.909
2015    1189.994
2016    2060.972
2017     906.905
Name: number, dtype: float64

### 15. Display Number of Fires Were Reported In Amazonas (Day-Wise)

In [53]:
df.groupby(['state','date'])['number'].sum().loc['Amazonas']

date
1998-01-01     946.000
1999-01-01    1061.000
2000-01-01     853.000
2001-01-01    1297.000
2002-01-01    2852.000
2003-01-01    1524.268
2004-01-01    2298.207
2005-01-01    1657.128
2006-01-01     997.640
2007-01-01     589.601
2008-01-01    2717.000
2009-01-01    1320.601
2010-01-01    2324.508
2011-01-01    1652.538
2012-01-01    1110.641
2013-01-01     905.217
2014-01-01    2385.909
2015-01-01    1189.994
2016-01-01    2060.972
2017-01-01     906.905
Name: number, dtype: float64

### 16. Find Total Number of Fires  Were Reported In 2015 And Visualize Data Based on Each ‘Month’

In [56]:
data=df[df['date'].dt.year==2015]

In [58]:
data.groupby('month_English')['number'].sum()

month_English
April        2573.000
August       4363.125
December     4088.522
Febuary      2309.000
January      4635.000
July         4364.392
June         3260.552
March        2202.000
May          2384.000
November     4034.518
October      4499.525
September    2494.658
Name: number, dtype: float64

### 17. Find Average Number of Fires Were Reported From Highest to Lowest (State-Wise)

In [59]:
df.groupby('state')['number'].mean().sort_values(ascending=False)

state
Sao Paulo           213.896226
Mato Grosso         203.479975
Bahia               187.222703
Piau                158.174674
Goias               157.721841
Minas Gerais        156.800243
Tocantins           141.037176
Amazonas            128.243218
Ceara               127.314071
Paraiba             111.073979
Maranhao            105.142808
Pará                102.561272
Pernambuco          102.502092
Roraima             102.029598
Santa Catarina      101.924067
Amapa                91.345506
Rondonia             84.876272
Acre                 77.255356
Rio                  64.698515
Espirito Santo       27.389121
Alagoas              19.271967
Distrito Federal     14.899582
Sergipe              13.543933
Name: number, dtype: float64

### 18.  To Find The State Names Where Fires Were Reported In 'dec' Month

In [61]:
df[df['month_English']=='December']['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'Pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'Rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)